import { figure1, figure2, figure3, figure4 } from "@/shared/images";

interface ServiceCategory {
  image: string;
  title: string;
  description: string;
  services: Service[];
}

interface Service {
  name: string;
  price: string;
}

export const serviceCategories: ServiceCategory[] = [
  {
    title: "Бухгалтерские разовые услуги",
    image: figure1,
    description:
      "Разовые операции, восстановление учета и подготовка отчетности.",
    services: [
      { name: "Разовая бухгалтерская услуга", price: "от 3 000 ₽" },
      { name: "Восстановление бухгалтерского учета", price: "от 10 000 ₽" },
      { name: "Подготовка корректирующего отчета", price: "4 000 ₽" },
      { name: "Сверка с контрагентом (1 документ)", price: "1 000 ₽" },
      {
        name: "Подготовка декларации 3-НДФЛ для физических лиц",
        price: "3 000 ₽",
      },
      { name: "Разблокировка счета (ИФНС, 115-ФЗ и др.)", price: "от 8 000 ₽" },
    ],
  },
  {
    title: "Консультации и юридическая поддержка",
    image: figure2,
    description:
      "Налоговые консультации, составление договоров и ответы на требования органов.",
    services: [
      {
        name: "Консультация по налогам и оптимизации налогообложения",
        price: "от 7 000 ₽",
      },
      { name: "Первичная консультация", price: "1 500 ₽" },
      {
        name: "Подготовка ответа на требования ИФНС, ФСС",
        price: "1 500–3 000 ₽",
      },
      {
        name: "Составление договора (поставки, аренды, оказания услуг и др.)",
        price: "от 2 000 ₽",
      },
      {
        name: "Составление заявления о переходе на УСНО, Патент или отказ",
        price: "1 500 ₽",
      },
    ],
  },
  {
    title: "Учет и сопровождение",
    image: figure3,
    description:
      "Кадровый учет, воинский учет и работа с кассой и эквайрингом.",
    services: [
      {
        name: "Учет кассы, торгового и интернет-эквайринга (1 шт.)",
        price: "1 500 ₽",
      },
      { name: "Учет по агентскому договору (1 шт.)", price: "2 000 ₽" },
      { name: "Ведение воинского учета", price: "от 10 000 ₽" },
      { name: "Кадровое сопровождение 1 сотрудника", price: "1 000 ₽" },
    ],
  },
  {
    title: "Электронная подпись и документы",
    image: figure4,
    description:
      "Оформление ЭЦП и подготовка пакета документов для банков и лизинга.",
    services: [
      { name: "Продление действующей ЭЦП", price: "3 000 ₽" },
      {
        name: "Подготовка пакета документов для кредита/лизинга, подбор условий",
        price: "от 12 000 ₽",
      },
    ],
  },
];
